package print;

public class Quiz01 {
	public static void main(String[] args) {
//					### 회비 정보 ###
//		=======================================
//		이름		나이					회비
//		=======================================
//		배수지	27					￦20,000
//		정국		30					￦30,000
//		아이린	29					￦50,000
//		=======================================
//		총합계						￦100,000
//		=======================================
// ㄹ + 한자키 => ￦, 수식 같은 ~
// ㅁ + 한자키 => 하트모양, 세모 ~
		System.out.println("\t### 회비 정보 ###");
		System.out.println("====================================");
		System.out.println("이름\t나이\t\t회비");
		System.out.println("====================================");
		System.out.println("배수지\t27\t\t￦20,000");
		System.out.println("정국\t30\t\t￦30,000");
		System.out.println("아이린\t29\t\t￦50,000");
		System.out.println("====================================");
		System.out.println("총합계\t\t\t￦100,000");
		System.out.println("====================================");

	}
}