package ex04_method;

public class Exam01 {
	public static void main(String[] args) {
		// 메서드 종류
		// 1. 반환값 없고 매개변수 없는 메서드
		// 2. 반환값 있고 매개변수 없는 메서드
		// 3. 반환값 없고 매개변수 있는 메서드
		// 4. 반환값 있고 매개변수 있는 메서드
		
		// 메서드 형식
		// [접근제한자] [반환데이터타입] [메서드명] (매개변수) {}
		
		// 접근 제한자
		// public : 외부 내부 클래스에서 접근 가능
		// protected : 외부 및 상속 클래스에서 접근 가능
		// default : 패키지 내부 클래스에서 접근 가능
		// private : 내부 클래스에서만 접근 가능
		
		// 반환데이터 타입 
		// - 우리가 사용하는 모든 타입 (기본타입, 참조타입)
		
		// 메서드명
		// - 첫글자는 소문자로 시작하고 연결 단어 첫글자는 대문자
		
		// 매개변수
		// - 전달 받을 자료형 및 변수명 
	}
}






